output/posts/ibm-cloud-commands/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>IBM Cloud Commands | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/ibm-cloud-commands/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<link rel="prev" href="../notes-on-hyperledger-fabric/" title="Notes on HyperLedger Fabric" type="text/html">
<link rel="next" href="../helm/" title="Helm" type="text/html">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="IBM Cloud Commands">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/ibm-cloud-commands/">
<meta property="og:description" content="This post contains the major IBM cloud CLI commands to operate with
some of the data services in the cloud. 



It especially focus around DaaS and MLaaS. 







Look at the ibmcloud connection set-u">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-02-05T13:09:09+01:00">
<meta property="article:tag" content="IBM Cloud Services">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-folder-open"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">IBM Cloud Commands</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2020-02-05T13:09:09+01:00" itemprop="datePublished" title="2020-02-05 13:09">2020-02-05 13:09</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/ibm-cloud-services/" rel="tag">IBM Cloud Services</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <br><br><p>
This post contains the major IBM cloud CLI commands to operate with
some of the data services in the cloud. 
</p>

<p>
It especially focus around DaaS and MLaaS. 
</p>

<!-- TEASER_END -->

<br><div id="outline-container-org9f208ad" class="outline-2">
<h2 id="org9f208ad">Look at the ibmcloud connection set-ups</h2>
<div class="outline-text-2" id="text-org9f208ad">
<div class="highlight"><pre><span></span><span class="c1">## to check at general access configuration on IBM cloud</span>
bx target

<span class="c1">## to look at general macro characteristics of your account</span>
ibmcloud account show
</pre></div>
</div>
</div>


<div id="outline-container-orgc18ca7a" class="outline-2">
<h2 id="orgc18ca7a">Interact with Watson ML</h2>
<div class="outline-text-2" id="text-orgc18ca7a">
<p>
You can change your IBM cloud region by setting
</p>

<div class="highlight"><pre><span></span>ibmcloud target -r us-south

<span class="c1">## notice that depending on the region you might have different deployments. </span>
<span class="c1">## deployments live in ibm datacenters and are hence bounded regionally.</span>

<span class="c1">## you can list your IBM Machine Learning Deployments using:</span>

bx ml list instances

<span class="c1">## In general bx ml is associated with CLI interaction with Watson</span>
<span class="c1">## Machine learning services.</span>

<span class="c1">## use the --help option whenever you are lost in the CLI </span>
</pre></div>

<p>
Notice that just because you have an existing instance ID it does not
mean that it is already set on your ibmcloud CLI. In order to set it
accordingly you have to specify it accordingly 
</p>

<div class="highlight"><pre><span></span>bx ml <span class="nb">set</span> instance &lt;instance-id&gt;
</pre></div>
</div>
</div>


<div id="outline-container-orgf92415b" class="outline-2">
<h2 id="orgf92415b">Object Storage</h2>
<div class="outline-text-2" id="text-orgf92415b">
<p>
To interact with object storage instances via CLI you must be sure the
plug-in is installed.
</p>

<div class="highlight"><pre><span></span>ibmcloud plugin install cloud-object-storage
</pre></div>

<p>
Once it is downloaded you will have to specify the way you want to interact with your Object Storage.
</p>

<p>
One way to do that is to specify your HMAC credentials to your Object Storage instance
</p>

<div class="highlight"><pre><span></span>ibmcloud cos config hmac
</pre></div>

<p>
Once entered the necessary <i>aki key</i> and <i>secret access key</i> you will
be able to access all of yours different buckets.
</p>

<div class="highlight"><pre><span></span>ibmcloud cos list-buckets
</pre></div>

<p>
For using the IAM authentification it is moreover possible to specify the
</p>

<div class="highlight"><pre><span></span>ibmcloud cos config crn
</pre></div>

<p>
And enter the <i>resource<sub>instance</sub><sub>id</sub></i> of the cloud object storage instance available in the cloud credentials. 
</p>
</div>
</div>


<div id="outline-container-orgad21686" class="outline-2">
<h2 id="orgad21686">Cloudant</h2>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../notes-on-hyperledger-fabric/" rel="prev" title="Notes on HyperLedger Fabric">Previous post</a>
            </li>
            <li class="next">
                <a href="../helm/" rel="next" title="Helm">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2020         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
